#importing pandas library

In [3]:
import pandas as pd

#reading the databases

In [7]:
providers = pd.read_csv(r"C:\Users\ASUS\Downloads\providers_data.csv")
receivers = pd.read_csv(r"C:\Users\ASUS\Downloads\receivers_data.csv")
food_listings = pd.read_csv(r"C:\Users\ASUS\Downloads\food_listings_data.csv")
claims = pd.read_csv(r"C:\Users\ASUS\Downloads\claims_data.csv")

providers

,Provider_ID,Name,Type,Address,City,Contact
0,1,Gonzales-Cochran,Supermarket,"74347 Christopher Extensions\nAndreamouth, OK ...",New Jessica,+1-600-220-0480
1,2,"Nielsen, Johnson and Fuller",Grocery Store,"91228 Hanson Stream\nWelchtown, OR 27136",East Sheena,+1-925-283-8901x6297
2,3,Miller-Black,Supermarket,"561 Martinez Point Suite 507\nGuzmanchester, W...",Lake Jesusview,001-517-295-2206
3,4,"Clark, Prince and Williams",Grocery Store,"467 Bell Trail Suite 409\nPort Jesus, IA 61188",Mendezmouth,556.944.8935x401
4,5,Coleman-Farley,Grocery Store,"078 Matthew Creek Apt. 319\nSaraborough, MA 53978",Valentineside,193.714.6577
...,...,...,...,...,...,...
995,996,"Vasquez, Ruiz and Flowers",Restaurant,"84308 Justin Stravenue\nNew Amberside, NE 53447",Williamview,+1-319-378-7627x0682
996,997,Garza-Williams,Catering Service,"08864 Figueroa Radial Suite 948\nJennaberg, AZ...",East Rossside,001-924-441-3963x746
997,998,Novak Group,Grocery Store,"934 Zachary Run\nMelissamouth, WY 02729",Joshuastad,(903)642-1969x3300
998,999,Moody Ltd,Grocery Store,"17580 Ernest Hills\nLake Michaelmouth, OR 56416",Stevenchester,637.300.3664x4880
999,1000,Jenkins-Brooks,Restaurant,"53390 Evans Rapids Suite 982\nLake Meghan, MO ...",Brendantown,266-324-3458x95775

#checking for null values

In [8]:
print(df.isnull().sum())

NameError: name 'df' is not defined

#importing MySQL

In [9]:
import mysql.connector

#connecting MySQL with python

In [10]:
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Akshat@1122",
    database="food_waste_data"

)
cursor = conn.cursor()

#creating food_waste database

In [11]:
cursor.execute("CREATE DATABASE IF NOT EXISTS food_waste_data")
print("MySQL database 'food_waste_data' created sucessfully!")

MySQL database 'food_waste_data' created sucessfully!

#using the specific database for creating schema

In [12]:
cursor.execute("use food_waste_data")

#creating table schema for providers

In [36]:
cursor.execute("""
    CREATE TABLE IF NOT EXISTS providers (
        Providers_ID INT PRIMARY KEY,
        Name VARCHAR(255),
        Type VARCHAR(100),
        Address TEXT,
        City VARCHAR(100),
        Contact VARCHAR(50)
    )
""")
conn.commit()

#transfering providers data into table database by using iterrows()

In [53]:
for index, row in providers.iterrows():
    cursor.execute("""
        INSERT INTO providers (Providers_ID, Name, Type, Address, City, Contact)
        VALUES (%s, %s, %s, %s, %s, %s)
        ON DUPLICATE KEY UPDATE
            Name = VALUES(Name),
            Type = VALUES(Type),
            Address = VALUES(Address),
            City = VALUES(City),
            Contact = VALUES(Contact)
    """, tuple(row))

conn.commit()

print("Data inserted successfully.")

Data inserted successfully.

#creating table schema for receivers

In [44]:
cursor.execute("""
    CREATE TABLE IF NOT EXISTS receivers (
        Receiver_ID INT PRIMARY KEY,
        Name VARCHAR(255),
        Type VARCHAR(100),
        City VARCHAR(100),
        Contact VARCHAR(50)
    )
""")
conn.commit()

#transfering receivers data into table database by using iterrows()

In [47]:
for index, row in receivers.iterrows():
    cursor.execute("""
        INSERT INTO receivers (Receiver_ID, Name, Type, City, Contact)
        VALUES (%s, %s, %s, %s, %s)
        ON DUPLICATE KEY UPDATE
            Name = VALUES(Name),
            Type = VALUES(Type),
            City = VALUES(City),
            Contact = VALUES(Contact)
    """, tuple(row))
conn.commit()

print("Data inserted or updated successfully.")

Data inserted or updated successfully.

#creating table schema for food_listings

In [50]:
cursor.execute("""
    CREATE TABLE IF NOT EXISTS food_listings (
        Food_ID INT PRIMARY KEY,
        Food_Name VARCHAR(255),
        Quantity VARCHAR(100),
        Expiry_Date VARCHAR(100),
        Provider_ID VARCHAR(50),
        Provider_Type VARCHAR(100),
        Location VARCHAR(100),
        Food_Type VARCHAR(100),
        Meal_Type VARCHAR(100)
    )
""")
conn.commit()

#transfering food_listings data into table database by using iterrows()

In [52]:
for index, row in food_listings.iterrows():
    cursor.execute("""
        INSERT INTO food_listings (Food_ID, Food_Name, Quantity, Expiry_Date, Provider_ID, Provider_Type, Location, Food_Type, Meal_Type)
        VALUES (%s,%s,%s,%s,%s,%s,%s,%s,%s)
        ON DUPLICATE KEY UPDATE
            Food_Name = VALUES(Food_Name),
            Quantity = VALUES(Quantity),
            Expiry_Date = VALUES(Expiry_Date),
            Provider_ID = VALUES(Provider_ID),
            Provider_Type = VALUES(Provider_Type),
            Location = VALUES(Location),
            Food_Type = VALUES(Food_Type),
            Meal_Type = VALUES(Meal_Type)
    """, tuple(row))
conn.commit()

print("Data inserted successfully.")

Data inserted successfully.

#creating table schema for claims

In [55]:
cursor.execute("""
    CREATE TABLE IF NOT EXISTS claims (
        Claim_ID INT PRIMARY KEY,
        Food_ID VARCHAR(255),
        Reciever_ID VARCHAR(100),
        Status VARCHAR(100),
        Timestamp VARCHAR(50)
    )
""")
conn.commit()

#transfering claims data into table database by using iterrows()

In [58]:
for index, row in claims.iterrows():
    cursor.execute("""
        INSERT INTO claims (Claim_ID, Food_ID, Reciever_ID, Status, Timestamp)
        VALUES (%s,%s,%s,%s,%s)
        ON DUPLICATE KEY UPDATE
            Food_ID = VALUES(Food_ID),
            Reciever_ID = VALUES(Reciever_ID),
            Status = VALUES(Status),
            Timestamp = VALUES(Timestamp)
    """, tuple(row))
conn.commit()

print("Data inserted successfully.")

Data inserted successfully.

# QUESTION & ANSWERS

# 1. How many food providers and receivers are there in each city?

In [13]:
query="""
SELECT city,
       SUM(provider_count) AS provider_count,
       SUM(receiver_count) AS receiver_count
FROM (
    SELECT city, COUNT(*) AS provider_count, 0 AS receiver_count
    FROM providers
    GROUP BY city

    UNION ALL

    SELECT city, 0 AS provider_count, COUNT(*) AS receiver_count
    FROM receivers
    GROUP BY city
) AS combined
GROUP BY city
ORDER BY city ASC;
"""
cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['city', 'provider_count', 'receiver_count'])
df

                city provider_count receiver_count
0         Aaronshire              0              1
1           Adambury              1              0
2           Adamland              0              1
3          Adamsview              1              0
4         Adamsville              1              0
...              ...            ...            ...
1873       Yatesside              1              0
1874    Youngchester              1              0
1875     Zacharyview              0              1
1876    Zimmermanton              1              0
1877  Zimmermanville              1              0

[1878 rows x 3 columns]

# 2. Which type of food provider (restaurant, grocery store, etc.) contributes the most food?

In [14]:
query = """
SELECT p.Type AS provider_type, SUM(f.quantity) AS total_food_contributed
FROM food_listings f
JOIN providers p ON f.provider_id = p.Providers_ID
GROUP BY p.Type
ORDER BY total_food_contributed DESC
LIMIT 1;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['provider_type', 'total_food_contributed'])
df

  provider_type  total_food_contributed
0    Restaurant                  6923.0

# 3. What is the contact information of food providers in a specific city?

In [15]:
query="""
SELECT Name, Contact, Address
FROM providers
WHERE City = 'New Jessica';
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Name', 'Contact', 'Address'])
df

,Name,Contact,Address
0,Gonzales-Cochran,+1-600-220-0480,"74347 Christopher Extensions\nAndreamouth, OK ..."

# 4. Which receivers have claimed the most food?

In [16]:
query = """
SELECT r.Name, SUM(f.quantity) AS total_claimed
FROM claims c
JOIN receivers r ON c.Reciever_ID = r.Receiver_ID
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY r.Name
ORDER BY total_claimed DESC
LIMIT 1;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Receiver Name', 'Total Claimed'])
df

  Receiver Name  Total Claimed
0  Matthew Webb          191.0

# 5. What is the total quantity of food available from all providers?

In [17]:
query="""
SELECT SUM(quantity) AS total_food_available
FROM food_listings;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Total Food Available'])
df

   Total Food Available
0               25794.0

# 6. Which city has the highest number of food listings?

In [18]:
query = """
SELECT p.City, COUNT(*) AS total_listings
FROM food_listings f
JOIN providers p ON f.provider_id = p.Providers_ID
GROUP BY p.City
ORDER BY total_listings DESC
LIMIT 1;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['City', 'Total Listings'])
df
df.index = range(1, len(df) + 1)
df

        City  Total Listings
1  New Carol               6

# 7. What are the most commonly available food types?

In [19]:
query = """
SELECT Food_Type, COUNT(*) AS occurrences
FROM food_listings
GROUP BY Food_Type
ORDER BY occurrences DESC;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Food Type', 'Occurrences'])
df.index = range(1, len(df) + 1)
df

        Food Type  Occurrences
1      Vegetarian          336
2           Vegan          334
3  Non-Vegetarian          330

# 8.How many food claims have been made for each food item?

In [20]:
query = """
SELECT f.Food_Name, COUNT(c.Claim_ID) AS total_claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY f.Food_Name
ORDER BY total_claims DESC;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Food Name', 'Total Claims'])
df.index = range(1, len(df) + 1)  # Start row index from 1
df

     Food Name  Total Claims
1         Rice           122
2         Soup           114
3        Dairy           110
4         Fish           108
5        Salad           106
6      Chicken           102
7        Bread            94
8        Pasta            87
9   Vegetables            86
10      Fruits            71

# 9. Which provider has had the highest number of successful food claims?

In [21]:
query = """
SELECT p.Name, COUNT(c.Claim_ID) AS successful_claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
JOIN providers p ON f.Provider_ID = p.Providers_ID
WHERE c.Status = 'Completed'
GROUP BY p.Name
ORDER BY successful_claims DESC
LIMIT 1;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Provider Name', 'Successful Claims'])
df.index = range(1, len(df) + 1)
df

  Provider Name  Successful Claims
1   Barry Group                  5

# 10. What percentage of food claims are completed vs. pending vs. canceled?

In [22]:
query = """
SELECT 
    Status,
    COUNT(*) AS count,
    ROUND(COUNT(*) * 100.0 / (SELECT COUNT(*) FROM claims), 2) AS percentage
FROM claims
GROUP BY Status
ORDER BY percentage DESC;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Status', 'Count', 'Percentage'])
df.index = range(1, len(df) + 1)
df

      Status  Count Percentage
1  Completed    339      33.90
2  Cancelled    336      33.60
3    Pending    325      32.50

# 11. What is the average quantity of food claimed per receiver?

In [23]:
query = """
SELECT 
    r.Name,
    AVG(CAST(f.Quantity AS UNSIGNED)) AS avg_quantity_claimed
FROM claims c
JOIN receivers r ON c.Reciever_ID = r.Receiver_ID
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY r.Name
ORDER BY avg_quantity_claimed DESC;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Receiver Name', 'Avg Quantity Claimed'])
df.index = range(1, len(df) + 1)
df

          Receiver Name Avg Quantity Claimed
1           Nancy Jones              50.0000
2            Lisa Pitts              50.0000
3    Christopher Wright              50.0000
4           Nancy Silva              50.0000
5          Peggy Knight              50.0000
..                  ...                  ...
616       John Reynolds               2.0000
617     Matthew Johnson               2.0000
618      Kenneth Barnes               2.0000
619        Amanda Kline               1.0000
620       Joshua Hooper               1.0000

[620 rows x 2 columns]

# 12. Which meal type (breakfast, lunch, dinner, snacks) is claimed the most?

In [24]:
query = """
SELECT f.Meal_Type, COUNT(c.Claim_ID) AS total_claims
FROM claims c
JOIN food_listings f ON c.Food_ID = f.Food_ID
GROUP BY f.Meal_Type
ORDER BY total_claims DESC;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Meal Type', 'Total Claims'])
df.index = range(1, len(df) + 1)
df

   Meal Type  Total Claims
1  Breakfast           278
2      Lunch           250
3     Snacks           240
4     Dinner           232

# 13. What is the total quantity of food donated by each provider?

In [192]:
query = """
SELECT 
    p.Name AS provider_name,
    SUM(CAST(f.Quantity AS UNSIGNED)) AS total_quantity_donated
FROM food_listings f
JOIN providers p ON f.Provider_ID = p.Providers_ID
GROUP BY p.Name
ORDER BY total_quantity_donated DESC;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Provider Name', 'Total Quantity Donated'])
df.index = range(1, len(df) + 1)
df

                       Provider Name Total Quantity Donated
1                         Miller Inc                    217
2                        Barry Group                    179
3         Evans, Wright and Mitchell                    158
4                        Smith Group                    150
5                       Campbell LLC                    145
..                               ...                    ...
624                   Reyes and Sons                      1
625                   Gonzales-Moore                      1
626                  Norris-Townsend                      1
627                        Mcgee PLC                      1
628  Martinez, Armstrong and Carroll                      1

[628 rows x 2 columns]

# Extra Questions

# 1. Top 10 Providers

In [194]:
query = """
SELECT 
    p.Name AS provider_name,
    SUM(CAST(f.Quantity AS UNSIGNED)) AS total_quantity_donated
FROM food_listings f
JOIN providers p ON f.Provider_ID = p.Providers_ID
GROUP BY p.Name
ORDER BY total_quantity_donated DESC
LIMIT 10;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Provider Name', 'Total Quantity Donated'])
df.index = range(1, len(df) + 1)
df

                 Provider Name Total Quantity Donated
1                   Miller Inc                    217
2                  Barry Group                    179
3   Evans, Wright and Mitchell                    158
4                  Smith Group                    150
5                 Campbell LLC                    145
6                   Nelson LLC                    142
7                   Ruiz-Oneal                    140
8            Blankenship-Lewis                    124
9                   Kelly-Ware                    123
10           Bradford-Martinez                    121

# 2. How many types of meals are available

In [197]:
query="""
SELECT DISTINCT Meal_Type FROM food_listings;
"""
cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Types of Meals'])
df.index = range(1, len(df) + 1)
df

  Types of Meals
1      Breakfast
2         Dinner
3          Lunch
4         Snacks

# 3. Which city has most food recievers

In [200]:
query="""
SELECT City, COUNT(*) AS receiver_count
FROM receivers
GROUP BY City
ORDER BY receiver_count DESC
LIMIT 1;
"""
cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['City','Most Food Recievers'])
df.index = range(1, len(df) + 1)
df

              City  Most Food Recievers
1  New Christopher                    3

# 4. Which food type have many providers

In [202]:
query = """
SELECT 
    Food_Type,
    COUNT(DISTINCT Provider_ID) AS provider_count
FROM food_listings
GROUP BY Food_Type
ORDER BY provider_count DESC;
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Food Type', 'Number of Providers'])
df.index = range(1, len(df) + 1)
df

        Food Type  Number of Providers
1           Vegan                  288
2      Vegetarian                  286
3  Non-Vegetarian                  284

# 5. Number of claims that are cancelled

In [204]:
query = """
SELECT COUNT(*) AS cancelled_claims
FROM claims
WHERE Status = 'Cancelled';
"""

cursor.execute(query)
result = cursor.fetchall()

df = pd.DataFrame(result, columns=['Cancelled Claims'])
df.index = range(1, len(df) + 1)
df

   Cancelled Claims
1               336